app/controllers/builds_controller.rb

  def index
    @builds = Build.page(params[:id])
---
SELECT "builds".* FROM "builds" ORDER BY finished_at LIMIT 3 OFFSET 39
SELECT COUNT(*) FROM "builds"

  def findRepos
    @repository = Repository.find(params[:repository_id])
    @builds = @repository.builds.all
---
SELECT "repositories".* FROM "repositories" WHERE "repositories"."id" = $1 LIMIT 1  [["id", "11565"]]
SELECT "builds".* FROM "builds" WHERE "builds"."repository_id" = 179689 ORDER BY finished_at

  def show
    @build = Build.find(params[:id])
---
SELECT "builds".* FROM "builds" WHERE "builds"."id" = $1 LIMIT 1  [["id", "3137"]]