app/controllers/commits_controller.rb

SELECT "commits".* FROM "commits" WHERE "commits"."id" = $1 LIMIT 1  [["id", "333315"]]
---
  def showBelongingCommit
    @commit = Commit.find(params[:commit_id])