app/controllers/commits_controller.rb

SELECT "commits".* FROM "commits" LIMIT 1000 OFFSET 0
SELECT COUNT(*) FROM "commits"
---
  def index
    @commits = Commit.page(params[:page])

SELECT "commits".* FROM "commits" WHERE "commits"."id" = $1 LIMIT 1  [["id", "3138"]]
---
  def show
    @commit = Commit.find(params[:id])

SELECT "builds".* FROM "builds" WHERE "builds"."id" = $1 LIMIT 1  [["id", "332964"]]
---
  def showBelongingCommit
    @build = Build.find(params[:build_id])