app/controllers/events_controller.rb

  def index
   # @events = Event.all
    @repository = Repository.find(params[:repository_id])
    @events = @repository.events.all
---
SELECT "repositories".* FROM "repositories" WHERE "repositories"."id" = $1 LIMIT 1  [["id", "77"]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "7312"]]