app/controllers/repositories_controller.rb

SELECT "repositories".* FROM "repositories" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "repositories"
---
  def index
    @repositories = Repository.page(params[:page])

SELECT "repositories".* FROM "repositories" WHERE "repositories"."id" = $1 LIMIT 1  [["id", "7"]]
---
  def show
    @repository = Repository.find(params[:id])